// Cpp1_3.cpp : 이 파일에는 'main' 함수가 포함됩니다. 거기서 프로그램 실행이 시작되고 종료됩니다.
//

#include <iostream>

int main() // main 함수, 가장 처음 실행 되는 함수
{
    std::cout << "Hello World!\n"; // std::cout을 이용하여 "Hello World"를 출력
}

// 주석
// - 소스 코드가 컴파일 될 때 포함 되지 않음
// - 소스 코드에 대한 설명을 위해 존재 함

// 한 줄 주석
// - Slash(/) 를 두 개 연달아 사용
// 여러 줄 주석
// - /* */ 를 사용

// 프로그램 실행 파일 위치
// - 솔루션 탐색기에서 솔루션 또는 프로젝트 우클릭 -> "파일 탐색기에서 폴더 열기" 선택 -> Debug 또는 Release 폴더 확인

// Debug/Release 모드
// Debug - 개발 시 
// Release - 출시 할 때

// 빌드
// - 프로젝트의 결과물(실행 파일, 라이브러리 등)을 만들기 위한 과정 

// 오류
// - 영문 오류 메시지가 유리
// - 오류 코드 검색

// 디버깅
// - 중단점(F9)를 이용하여 해당 단계까지 실행 가능
// - 한 줄 씩 실행(F10)을 하여 코드 확인 가능

// 프로그램 실행: <Ctrl+F5> 또는 [디버그] > [디버깅하지 않고 시작] 메뉴
// 프로그램 디버그: <F5> 키 또는 [디버그] > [디버깅 시작] 메뉴

// 시작을 위한 팁: 
//   1. [솔루션 탐색기] 창을 사용하여 파일을 추가/관리합니다.
//   2. [팀 탐색기] 창을 사용하여 소스 제어에 연결합니다.
//   3. [출력] 창을 사용하여 빌드 출력 및 기타 메시지를 확인합니다.
//   4. [오류 목록] 창을 사용하여 오류를 봅니다.
//   5. [프로젝트] > [새 항목 추가]로 이동하여 새 코드 파일을 만들거나, [프로젝트] > [기존 항목 추가]로 이동하여 기존 코드 파일을 프로젝트에 추가합니다.
//   6. 나중에 이 프로젝트를 다시 열려면 [파일] > [열기] > [프로젝트]로 이동하고 .sln 파일을 선택합니다.
